# WallAndColumnSplitting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..WallAndColumnSplitting Property
ExporterIFC Class See Also
---
Identifies if division of multi-level walls and columns by levels should take place during this export.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool WallAndColumnSplitting { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WallAndColumnSplitting As Boolean
	Get
```

Visual C++
---
```text
public:
property bool WallAndColumnSplitting {
	bool get ();
}
```

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace